social-flow-backend/tools/load-testing/artillery/artillery.yml
config:
  target: "${ARTILLERY_TARGET}"
  defaults:
    headers:
      Accept: "application/json"
      Content-Type: "application/json"
  phases:
    - duration: 300
      arrivalRate: 10
      rampTo: 200
      name: "ramp-up"
  processor: "./scripts/generate_jwt.js"
  tls:
    rejectUnauthorized: false

plugins:
  influxdb:
    http:
      url: "${INFLUXDB_URL}"
      token: "${INFLUXDB_TOKEN}"
      org: "${INFLUXDB_ORG}"
      bucket: "${INFLUXDB_BUCKET}"
      interval: 5

scenarios:
  - name: "Master user journey mix"
    flow:
      - log: "Starting master journey"
      - function: "setupAuth"
      - loop:
          count: 5
          steps:
            - get:
                url: "/v1/explore"
                capture:
                  - json: "$.items[0].id"
                    as: "first_item_id"
            - post:
                url: "/v1/items/{{ first_item_id }}/view"
                json:
                  metadata:
                    source: "loadtest"
            - think: 0.5
            - get:
                url: "/v1/users/{{ user_id }}/timeline?page=1&limit=20"

include:
  - scenarios/user_journey.yml
  - scenarios/soak_test.yml
  - scenarios/smoke.yml